# Make sure apps are installed in system Applications dir
cask_args appdir: "/Applications"

# Tap Homebrew
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "civo/tools"
tap "anchore/grype"

# Apps
cask "firefox"
cask "raycast"
cask "vlc"
cask "visual-studio-code"
cask "slack"

# Install ZSH
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Install Binaries
brew "mas"
brew "curl"
brew "wget"
brew "git"
brew "node"
brew "mackup"

# Dev
brew "ruby"
brew "yarn"
brew "python"
brew "pyenv"
brew "go"

