cask_args appdir: "/Applications"

# Tap Homebrew
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "civo/tools"
tap "anchore/grype"

cask "firefox"
cask "todoist"
cask "obs"
cask "vlc"
cask "visual-studio-code"
cask "discord"

# System
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "mas"
brew "curl"
brew "wget"
brew "git"
brew "openssl"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "binutils"
brew "rename"
brew "gnu-sed"
brew "gnu-tar"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "tree"
brew "htop"
brew "pidof"
brew "pstree"
brew "grep"
brew "openssh"
brew "rsync"
brew "ssh-copy-id"
brew "screen"
brew "gmp"
brew "nmap"
brew "socat"
brew "rlwrap"
brew "dnstracer"
brew "sslscan"
brew "watch"
brew "viddy"
brew "ripgrep"
brew "xq"
brew "dnsx"
brew "broot"

# Ops
## iac 
brew "ansible"


# Images, Audio, Video
brew "imagemagick"
brew "gifsicle"
brew "gifify"
brew "ffmpeg"

# Archive & Git
brew "xz"
brew "p7zip"
brew "git"
brew "git-lfs"
brew "tig"
brew "hub"


# JSON
brew "jq"
brew "jo"

# Dev
brew "ruby"
brew "yarn"
brew "python"
brew "pyenv"
brew "go"

# git-sim
brew "py3cairo"
brew "pango"
brew "scipy"

